# Основные структуры

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame([['Anna', 23, 3],
             ['Sam',36 , 12],
             ['Bill', 33, 10],
             ['Moica', 25, 7],
             ['Lisa', 27 , 7],
             ['Peter', 32, None]])

In [14]:
df

       0   1     2
0   Anna  23   3.0
1    Sam  36  12.0
2   Bill  33  10.0
3  Moica  25   7.0
4   Lisa  27   7.0
5  Peter  32   NaN

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df[0]

0     Anna
1     Bill
2    Moica
3     Lisa
4    Peter
Name: 0, dtype: object

In [8]:
type(df[0])

pandas.core.series.Series

# индексы и метод .iloc

In [10]:
df.columns = ['name', 'age', 'expr']

In [11]:
df

    name  age  expr
0   Anna   23   3.0
1    Sam   36  12.0
2   Bill   33  10.0
3  Moica   25   7.0
4   Lisa   27   7.0

In [17]:
df.iloc[1,2]

12.0

In [18]:
df.iloc[4,1]

27

In [19]:
df.iloc[1:3, 1]

1    36
2    33
Name: age, dtype: int64

In [20]:
df.iloc[:, 0]

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: name, dtype: object

In [22]:
df.iloc[1:3, :]

   name  age  expr
1   Sam   36  12.0
2  Bill   33  10.0

In [23]:
df[0:2]

   name  age  expr
0  Anna   23   3.0
1   Sam   36  12.0

In [25]:
df['name']

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: name, dtype: object

In [26]:
df.iloc[0]

name    Anna
age       23
expr       3
Name: 0, dtype: object

#  индексы и метод .loc

In [27]:
df['name']

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: name, dtype: object

In [32]:
df['name'][3]

'Moica'

In [34]:
df[['name', 'expr']] # выбрали из старого

    name  expr
0   Anna   3.0
1    Sam  12.0
2   Bill  10.0
3  Moica   7.0
4   Lisa   7.0
5  Peter   NaN

In [12]:
df.index = df['name']

In [13]:
df

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

In [37]:
df.loc['Bill','age']

33

In [39]:
df.loc['Bill':'Lisa','expr'] # у текстовых срезов правый конец включается

name
Bill     10.0
Moica     7.0
Lisa      7.0
Name: expr, dtype: float64

In [41]:
df.loc['Bill':'Lisa', ['age','expr']]

       age  expr
name
Bill    33  10.0
Moica   25   7.0
Lisa    27   7.0

In [42]:
df.loc['Bill':]

        name  age  expr
name
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [52]:
df.loc['Bill',:]

name    Bill
age       33
expr      10
Name: Bill, dtype: object

In [1]:
# в loc and iloc на первом месте указывается строк,на втором - столбцов

# Характеристики датафрейма pandas

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Anna to Peter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   expr    5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 352.0+ bytes

In [56]:
df.shape[0] #strok

6

In [57]:
df.shape[1] #stolbcov

3

In [58]:
df.describe()

             age       expr
count   6.000000   5.000000
mean   29.333333   7.800000
std     5.085928   3.420526
min    23.000000   3.000000
25%    25.500000   7.000000
50%    29.500000   7.000000
75%    32.750000  10.000000
max    36.000000  12.000000

In [59]:
df

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [61]:
df.columns

Index(['name', 'age', 'expr'], dtype='object')

In [62]:
list(df.columns)

['name', 'age', 'expr']

In [65]:
df.index

Index(['Anna', 'Sam', 'Bill', 'Moica', 'Lisa', 'Peter'], dtype='object', name='name')

# Операции над датафреймами

In [69]:
df

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [7]:
df.head() #выводится по умолчанию первые 5

       0   1     2
0   Anna  23   3.0
1    Sam  36  12.0
2   Bill  33  10.0
3  Moica  25   7.0
4   Lisa  27   7.0

In [67]:
df.head(2)

      name  age  expr
name
Anna  Anna   23   3.0
Sam    Sam   36  12.0

In [68]:
df.tail(3)

        name  age  expr
name
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [70]:
# можно удалить строку с пропущенным значением

In [8]:
df = df.dropna()

In [72]:
df

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

In [73]:
# данные по Питеру исчезли

In [14]:
df[df['age'] > 30]

      name  age  expr
name
Sam    Sam   36  12.0
Bill  Bill   33  10.0

In [76]:
df[(df['age'] > 30) & (df['expr'] > 7)]

      name  age  expr
name
Sam    Sam   36  12.0
Bill  Bill   33  10.0

In [16]:
df[(df['age'] > 35) | (df['age'] < 25)]

      name  age  expr  age_sq
name
Anna  Anna   23   3.0     529
Sam    Sam   36  12.0    1296

# Операции над датафреймами

In [78]:
# с объектами здесь можно работать поэлементно

In [17]:
df['age_sq'] = df['age'] ** 2

<ipython-input-17-5aa0fed74fdd>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age_sq'] = df['age'] ** 2

In [18]:
df['age_sq']

name
Anna      529
Sam      1296
Bill     1089
Moica     625
Lisa      729
Name: age_sq, dtype: int64

In [81]:
df

        name  age  expr  age_sq
name
Anna    Anna   23   3.0     529
Sam      Sam   36  12.0    1296
Bill    Bill   33  10.0    1089
Moica  Moica   25   7.0     625
Lisa    Lisa   27   7.0     729

In [87]:
df['status'] = 'W' # как в экселе стянули вниз

<ipython-input-87-1000886e9eb9>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['status'] = 'W' # как в экселе стянули вниз

In [88]:
df

        name  age  expr  age_sq status
name
Anna    Anna   23   3.0     529      W
Sam      Sam   36  12.0    1296      W
Bill    Bill   33  10.0    1089      W
Moica  Moica   25   7.0     625      W
Lisa    Lisa   27   7.0     729      W

In [89]:
df['gender'] = [0, 1, 1, 0, 0] # количество элементов должно совпадать

<ipython-input-89-a8320a754895>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['gender'] = [0, 1, 1, 0, 0]

In [90]:
df

        name  age  expr  age_sq status  gender
name
Anna    Anna   23   3.0     529      W       0
Sam      Sam   36  12.0    1296      W       1
Bill    Bill   33  10.0    1089      W       1
Moica  Moica   25   7.0     625      W       0
Lisa    Lisa   27   7.0     729      W       0

In [91]:
df['no_work'] = df['age'] - df['expr']

<ipython-input-91-0f97f0108c10>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['no_work'] = df['age'] - df['expr']

In [92]:
df

        name  age  expr  age_sq status  gender  no_work
name
Anna    Anna   23   3.0     529      W       0     20.0
Sam      Sam   36  12.0    1296      W       1     24.0
Bill    Bill   33  10.0    1089      W       1     23.0
Moica  Moica   25   7.0     625      W       0     18.0
Lisa    Lisa   27   7.0     729      W       0     20.0